Repository: AdrianaGRO/PyArch.dev
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: es, ro

source: About
es: Acerca de
ro: Despre

source: Me
es: Mí
ro: Mine

source: Bridging the gap between complex business operations and elegant Python automation.
es: Cerrando la brecha entre operaciones comerciales complejas y la elegante automatización Python.
ro: Legătura între operațiunile de afaceri complexe și automatizarea elegantă Python.

source: The Journey
es: El Viaje
ro: Călătoria

source: As a business analyst, I spent years navigating limitations. "It's impossible" was a phrase I heard too often when trying to optimize workflows. This frustration became my catalyst.
es: Como analista de negocios, pasé años navegando limitaciones. "Es imposible" era una frase que escuchaba demasiado a menudo cuando trataba de optimizar flujos de trabajo. Esta frustración se convirtió en mi catalizador.
ro: Ca analist de afaceri, am petrecut ani întregi navigând limitări. "Este imposibil" era o frază pe care o auzeam prea des când încercam să optimizez fluxurile de lucru. Această frustrare a devenit catalizatorul meu.

source: I don't just write code; I translate operational pain into technical solutions.
es: No solo escribo código; traduzco el dolor operacional en soluciones técnicas.
ro: Nu scriu doar cod; traduc durerea operațională în soluții tehnice.

source: Projects
es: Proyectos
ro: Proiecte

source: Pricing
es: Precios
ro: Prețuri

source: Contact
es: Contacto

source: Python automation solutions for business operations. Building efficient tools that solve real problems.
es: Soluciones de automatización Python para operaciones comerciales. Construyendo herramientas eficientes que resuelven problemas reales.
ro: Soluții de automatizare Python pentru operațiuni de afaceri. Construind instrumente eficiente care rezolvă probleme reale.

source: Quick Links
es: Enlaces Rápidos
ro: Link-uri Rapide

source: Automation
es: Automatización
ro: Automatizare

source: Portfolio
es: Portafolio
ro: Portofoliu

source: Custom Python tools designed to transform manual business workflows into efficient code.
es: Herramientas Python personalizadas diseñadas para transformar flujos de trabajo comerciales manuales en código eficiente.
ro: Instrumente Python personalizate concepute pentru a transforma fluxurile de lucru manuale în cod eficient.

source: Explore Solution
es: Explorar Solución
ro: Explorează Soluția

source: It's not impossible, you just haven't found a way yet.
es: No es imposible, simplemente aún no has encontrado la manera.
ro: Nu este imposibil, doar nu ai găsit încă o modalitate.

source: Have a manual workflow to automate?
es: ¿Tienes un flujo de trabajo manual para automatizar?
ro: Ai un flux de lucru manual de automatizat?

source: I specialize in turning messy operational data into clean, automated assets.
es: Me especializo en convertir datos operacionales desordenados en activos automatizados y limpios.
ro: Mă specializez în transformarea datelor operaționale dezordonate în active automatizate și curate.

source: Get a Free Audit
es: Obtener una Auditoría Gratuita
ro: Obține o Auditare Gratuită

source: Ready to Automate Your Workflow?
es: ¿Listo para Automatizar tu Flujo de Trabajo?
ro: Gata să-ți automatizezi fluxul de lucru?

source: Let's discuss your project. Reach out directly and I'll respond within 24 hours on weekdays.
es: Hablemos de tu proyecto. Contáctame directamente y te responderé dentro de 24 horas en días laborables.
ro: Să discutăm despre proiectul tău. Contactează-mă direct și voi răspunde în 24 de ore în zilele lucrătoare.

source: Email
es: Correo

source: Available for New Projects
es: Disponible para Nuevos Proyectos
ro: Disponibil pentru Proiecte Noi

source: Stop fighting with spreadsheets.
es: Deja de luchar con las hojas de cálculo.
ro: Nu mai lupta cu fișierele Excel.

source: I automate the struggle.
es: Yo automatizo esa lucha.
ro: Eu automatizez această problemă.

source: 15+ years of retail operations experience meeting modern Python automation. I build custom tools that transform hours of manual data work into seconds of code execution.
es: 15+ años de experiencia en operaciones minoristas encontrándose con la automatización moderna de Python. Construyo herramientas personalizadas que transforman horas de trabajo manual de datos en segundos de ejecución de código.
ro: 15+ ani de experiență în operațiuni retail întâlnind automatizarea modernă Python. Construiesc instrumente personalizate care transformă ore de lucru manual cu date în secunde de execuție cod.
